In [10]:
import requests
import pandas as pd
import matplotlib as mpl

url = 'https://data.cityofnewyork.us/api/views/7yc5-fec2/rows.csv'
url_file = requests.get(url)

print('Status code:', url_file.status_code)

Status code: 200

In [ ]:
dataset = pd.read_csv(url)
dataset.head()

In [11]:
df = pd.DataFrame(dataset, columns=['School Name', 'Category', 'Total Enrollment', '#Female', '#Male'])

df.head()

,School Name,Category,Total Enrollment,#Female,#Male
0,P.S. 015 Roberto Clemente,All Students,162.0,79,83
1,P.S. 015 Roberto Clemente,Attend school outside district of residence,37.0,24,13
2,P.S. 015 Roberto Clemente,English Language Learners,16.0,7,9
3,P.S. 015 Roberto Clemente,Poverty,162.0,79,83
4,P.S. 015 Roberto Clemente,Reside in temporary housing,65.0,26,39

In [ ]:
df.columns = [title.lower().replace(" ", "_").replace("#", "") for title in df.columns]
df.columns

In [16]:
df.dtypes

school_name          object
category             object
total_enrollment    float64
female               object
male                 object
dtype: object

In [17]:
df1 = df.dropna()
df.isnull().sum()

school_name           6
category              0
total_enrollment    223
female                0
male                  0
dtype: int64

In [18]:
df1.isnull().sum()

school_name         0
category            0
total_enrollment    0
female              0
male                0
dtype: int64

In [19]:
df1 = df1.drop(df1[(df1.total_enrollment == 's') | (df1.female == 's') | (df1.male == 's')].index)

In [20]:
datatypes = {'school_name': str,
            'category': str,
            'total_enrollment': int,
            'female': int,
            'male': int}

df1 = df1.astype(datatypes)
df1.dtypes

school_name         object
category            object
total_enrollment     int32
female               int32
male                 int32
dtype: object

In [21]:
df1.head()

,school_name,category,total_enrollment,female,male
0,P.S. 015 Roberto Clemente,All Students,162,79,83
1,P.S. 015 Roberto Clemente,Attend school outside district of residence,37,24,13
2,P.S. 015 Roberto Clemente,English Language Learners,16,7,9
3,P.S. 015 Roberto Clemente,Poverty,162,79,83
4,P.S. 015 Roberto Clemente,Reside in temporary housing,65,26,39

In [29]:
df2 = pd.DataFrame(df1, columns=["school_name"])
df2.drop_duplicates(inplace=True, ignore_index=True)
list(df2.columns)

['school_name']

In [21]:
df3 = pd.DataFrame(df1, columns=["category"])
df3.drop_duplicates(inplace=True, ignore_index=True)
df3

                                      category
0                                 All Students
1  Attend school outside district of residence
2                    English Language Learners
3                                      Poverty
4                  Reside in temporary housing
5                   Students with Disabilities

In [1]:
 columns_to_use_raw = [
        "School Name",
        "Category",
        "Total Enrollment",
        "#Female",
        "#Male",
    ]

columns_to_use_final = [col.lower().replace(" ", "_").replace("#", "") for col in columns_to_use_raw]

columns_to_use_final

['school_name', 'category', 'total_enrollment', 'female', 'male']

In [5]:
COLUMNS = {
    "School Name": str,
    "Category": str,
    "Total Enrollment": int,
    "#Female": int,
    "#Male": int,
}

columns_to_use = [col.lower().replace(" ", "_").replace("#", "") for col in COLUMNS.keys()]
datatypes = {col.lower().replace(" ", "_").replace("#", "") : typ for (col, typ) in COLUMNS.items()}
columns_to_use
datatypes

{'school_name': str,
 'category': str,
 'total_enrollment': int,
 'female': int,
 'male': int}